### 실습3

In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.DataFrame(
        {'a': [4,5,6],
        'b': [7,8,9],
        'c': [10,11,12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))

In [3]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [4]:
df[df>7]

      a    b   c
n v
d 1 NaN  NaN  10
  2 NaN  8.0  11
e 2 NaN  9.0  12

In [5]:
df[df.b>7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [6]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [7]:
df[df.c > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [8]:
df[df['c'] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [9]:
df[df['c'] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [10]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [11]:
df2= pd.DataFrame(
        {'a': [4,5,6,6],
        'b': [7,8,9,9],
        'c': [10,11,12,12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']))

In [12]:
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [13]:
df2.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [14]:
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [15]:
df2.drop_duplicates(inplace=True)

In [16]:
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [17]:
df2=df2.drop_duplicates()
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [18]:
df2=df2.drop_duplicates(keep='last')
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

### 실습 4

In [19]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [20]:
df['a'] !=7

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [21]:
df[df['a'] !=7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [24]:
df['a'].isin()   # 에러 발생 isin()에서 괄호 안에 값을 넣어야 함

TypeError: isin() missing 1 required positional argument: 'values'

In [26]:
df['a'].isin([5])  # int를 넣으면 안되면 array, 즉 list를 넣어야 함

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [27]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [ ]:
# 임의의 null 발생

In [28]:
df3= pd.DataFrame(
        {'a': [4,5,6,6,np.nan],
        'b': [7,8,np.nan,9,9],
        'c': [10,11,12,np.nan,12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3), ('e',3)],
        names=['n','v']))

In [29]:
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [30]:
pd.isnull(df3)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  3   True  False  False

In [31]:
df3.a.isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [33]:
df3['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [34]:
df3['a'].isnull().sum()

1

In [35]:
pd.notnull(df3)   #pd.isnull(d3) 와 True/False가 반대림

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  3  False   True   True

In [36]:
df3.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [37]:
df3.any()  # 하나라도 notnull 이 있는지

a    True
b    True
c    True
dtype: bool

In [38]:
-df3.a.notnull()  # df3['a']열에 null 이면 True

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [39]:
1 and 1

1

In [40]:
True and False

False

In [ ]:
## DataFrame 에서는 and 사용 불가

In [41]:
df3[df3['b'] == 7] | df3[df3['a'] == 5]   # 에러남

TypeError: unsupported operand type(s) for |: 'float' and 'bool'

### 실습5

In [42]:
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [43]:
df3.head(3)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [44]:
df3.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [46]:
df3.sample(frac=0.5)

       a    b     c
n v
e 3  6.0  9.0   NaN
d 1  4.0  7.0  10.0

In [47]:
df3.sample(frac=0.7)

       a    b     c
n v
e 3  NaN  9.0  12.0
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
d 1  4.0  7.0  10.0

In [48]:
df3.sample(frac=0.3)

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [49]:
df3.sample(n=10)  # 전체 데이타 이내여야만 함. 아니면 에러남

ValueError: Cannot take a larger sample than population when 'replace=False'

In [50]:
df3.sample(n=3)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [51]:
df3.iloc[10:20]  # 해당 범위가 없으므로 값이 안 나타남

Empty DataFrame
Columns: [a, b, c]
Index: []

In [52]:
df3.iloc[:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [54]:
df3.iloc[:2]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [53]:
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [55]:
df3.iloc[3:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [56]:
df3.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [57]:
df3.iloc[-2:-1]

       a    b   c
n v
e 3  6.0  9.0 NaN

In [58]:
df4= pd.DataFrame(
        {'a': [1,10,8,11,-1],
        'b': list('abcde'),
        'c': [1.0,2.0,np.nan,3.0, 4.0]})
df4

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [59]:
df4.nlargest(1,'a')

    a  b    c
3  11  d  3.0

In [60]:
df4.nlargest(1,'b')  # 에러발생, 숫자만 가져올 수 있음

TypeError: Column 'b' has dtype object, cannot use method 'nlargest' with this dtype

In [63]:
df4.nlargest(3,'c')   # 큰 거 3개 갖고 와라. 큰값정렬

    a  b    c
4  -1  e  4.0
3  11  d  3.0
1  10  b  2.0

In [66]:
df4.nsmallest(3,'c') # 'c' 에서 가장 작은 것을 3개 가져오되, 작은 순서로 정렬

    a  b    c
0   1  a  1.0
1  10  b  2.0
3  11  d  3.0